Repository: 84000/data-translation-memory
Catalog: toh431-v1.tmx
Source language: bo
Languages: en

source: སྐྱེ་བོ་ཀུན་གྱི་འཁྲིག་སྤྱོད་པས། །ཡོངས་སུ་ངལ་བ་ཆེན་པོར་གྱུར། །
en: “The fatigue of any person practicing Sexual intercourse would be great.

source: མགོན་པོ་ཁྱོད་ཀྱིས་གསུང་བར་རིགས། །
en: Please deign to explain, O lord,

source: དེ་ཡི་ངལ་སོའི་གནས་ཉིད་ནི། །
en: how to remove this fatigue.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། །
en: The lord said:

source: བུད་མེད་བདེ་བ་ལ་དམིགས་ནས། །རང་གིས་མངོན་སུམ་དགག་པར་བྱ། །
en: “When one has noticed, with one’s own senses, That the pleasure given by the woman has died out,

source: ཤ་དང་ཉ་ནི་བཟའ་བར་བྱ། །
en: One should eat fish and meat,

source: ཆང་ནི་བཏུང་བྱ་མཉམ་བཞག་པས། །
en: And drink wine, being focused.

source: གཞན་ཡང་ཇི་ལྟར་རྙེད་པ་བཟའ། །
en: “Other food too, as available,

source: ཐོག་མར་བུད་མེད་ལ་བྱིན་ནས། །
en: First he should give to the woman,

source: དེ་ཡི་ལྷག་མ་བཟའ་བར་བྱ། །
en: And eat only what has been left by her.

source: དེ་ཡི་ལྷག་མའི་སྣོད་ལ་ནི། །ལོངས་ནི་རྟག་ཏུ་སྤྱད་པར་བྱ།
en: “One should always eat From her dish of leftovers.

source: དེ་ཡི་ཁ་བཤལ་ཆུ་དང་ནི། །པདྨ་བཀྲུས་པའང་བཏུང་བར་བྱ། །
en: One should drink the water with which she washes her mouth And the water with which she washes her lotus.

source: བཤང་སྒོ་པདྨ་བཀྲུས་བཟུང་ནས། །བརྟུལ་ཞུགས་ཅན་གྱིས་ཁ་སོགས་བཀྲུ། །
en: “One should take the water with which she washes her anus

source: དེ་ཡི་སྐྱུགས་པ་བཟའ་བྱ་ཞིང་། །དེ་ཡི་བཞི་མཉམ་བཟའ་བར་བྱ། །
en: One should also eat her vomit And her excreta,

source: སྐྱེ་གནས་ལས་བྱུང་བཏུང་བར་བྱ། །
en: “And one should drink water born from her vulva,

source: ཇི་ལྟར་ཤིང་ལ་ལུད་སོགས་ཀྱིས། །འབྲས་བུ་ལྷག་པར་འགྱུར་བ་ལྟར། །
en: Just as, after applying compost, The tree will bear more fruit,

source: དེ་བཞིན་མི་གཙང་སོགས་སྤྱོད་པས།
en: “In exactly the same way, by partaking of these impurities,

source: སྐྱེས་བུ་ལ། །ན་དང་རྒས་པ་ཉིད་དང་ནི། །དེ་ཡི་ལུས་ལ་འཆི་བ་མེད། །
en: For such people, there is neither Old age, nor disease, nor death.

source: གང་དེའི་མི་གཙང་སྟེན་བྱེད་པའི། །རྣལ་འབྱོར་པ་ཡིས་དེ་འགྲུབ་བྱེད། །
en: “Whoever applies himself to these impurities will succeed,

source: གང་དུ་བཟའ་དང་བཟའ་མིན་དང་། །འདིར་ནི་རྣམ་རྟོག་མི་བྱའོ། །
en: One should never think whether Something is edible or not.

source: སྦྱོར་རིག་བྱ་དང་བྱ་མིན་དང་། །
en: Even if he does not practice yoga.

source: བསོད་ནམས་མེད་ཅིང་སྡིག་པའང་མེད། །
en: There is neither merit nor sin;

source: མཐོ་རིས་ཐར་པར་བརྟག་མི་བྱ། །
en: One should not think about higher realms or liberation.

source: དེ་ཉིད་སྦྱོར་ལྡན་རྣལ་འབྱོར་པ། །
en: The yogin who practices yoga in this way,

source: ཁྲོ་བོ་གཏུམ་པོ་གཅིག་སྦྱོར་པས། །
en: Through the practice of being one with Caṇḍa­mahā­roṣaṇa,

source: སྡིག་པ་རྣམས་ཀྱིས་གོས་མི་འགྱུར། །
en: Would not be stained by sin

source: གལ་ཏེ་བྲམ་ཟེ་བརྒྱ་བསད་ཀྱང་། །
en: Even if he were to kill one hundred brahmins.

source: ཁྲོ་བོ་གཏུམ་པོ་དེ་ཉིད་བསྒོམ། །
en: “One should therefore meditate on Caṇḍa­mahā­roṣaṇa,

source: སྐྱེ་བོ་གང་ཞིག་དྲག་པོ་ཡི། །ལས་ཀྱིས་དམྱལ་བར་འགྲོ་བྱེད་ཀྱང་། །
en: And violent acts, That would lead ordinary people to hell,

source: ཡིད་ནི་སྔོན་དུ་འགྲོ་བ་འདི། །
en: All this is preceded by mind;

source: ཡིད་དང་རྣམ་རྟོག་རྣམ་པ་ལ། །
en: “Forms created by the mind

source: གནས་ལ་སོགས་པའི་དབྱེ་བར་བསྟན། །
en: Vary according to one’s place of birth,

source: ཇི་ལྟར་སྔགས་དང་བྲལ་བ་ཡི། །དུག་ཟོས་པས་ནི་ཚེ་ཟད་འགྱུར། །
en: In the same way that, if one eats a poison Not incanted with the mantra, one’s life will wane,

source: སྔགས་དང་དེ་ཉིད་ཤེས་པ་ཡིས། །བདེ་བ་དང་ནི་ཚེ་འཕེལ་བྱེད། །
en: “But after incanting the same poison with a mantra, One’s happiness and lifespan will increase.”

source: དེ་ནས་སྐད་ཅིག་དེ་ལ་
en: Then, at that moment,

source: ལྷ་མོ་མཆོག་གི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་མས་གྲི་གུག་དང་། ཐོད་པའི་ཕྱག་གིས་ཁྲོ་བོ་གཏུམ་པོའི་ཕྱག་རྒྱས།
en: The supreme goddess, Perfection of Wisdom ‌, With a knife and a skull cup in her hands, And with Caṇḍa­mahā­roṣaṇa as the seal upon her head,

source: རྡོ་རྗེ་གཏུམ་མོ་ཁྲོ་ཆེན་མས། །
en: Vajra-fierce, very angry,

source: བདག་གི་གཟུགས་ནི་བསྒོམ་བྱས་ནས། །ང་རྒྱལ་མཆོག་འདི་བྱས་གྱུར་ན། །
en: “Meditating on my form And identifying perfectly with me,

source: སྡིག་པ་ཡིས་ནི་གོས་མི་འགྱུར། །
en: She will not be stained by sin,

source: ཁྲོ་ཆེན་སེམས་ཉིད་གཅིག་པུ་ཡིས། །
en: With great wrath alone in her mind,

source: བརྩེ་མེད་གཡོ་དང་ཁྲོ་བ་དང་། །
en: Without compassion, fickle and irritable,

source: གསོད་པའི་དོན་ཕྱིར་སེམས་དཔའ་ཅན།
en: With their thoughts on the profits derived from killing—

source: དཔའ་བོ་གཅིག་པ་ཉིད་དུ་གསུངས་པའི་ཁྲོ་བོ་གཏུམ་པོ་ཆེན་པོའི་རྒྱུད་ལས། ལུས་ཀྱི་བདེ་བའི་རིམ་པར་ཕྱེ་བ་སྟེ་བདུན་པའོ།།
en: Thus concludes the chapter on revitalizing the body, the seventh in the glorious Caṇḍa­mahā­roṣaṇa tantra called “ The Sole Hero

source: དགའ་མ་ཁྱོད་གཟུགས་རྣལ་འབྱོར་པས། །ཇི་ལྟ་བུར་ན་ཤེས་པར་བྱ། །
en: “How should a yogin Perceive your form, dear?

source: བཅོམ་ལྡན་འདས་མར་གུས་བྱ་བ། །རྣལ་འབྱོར་པ་ཡིས་གང་ལ་བྱ། །
en: And by what means should the goddess Be honored by the yogins?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་མས་བཀའ་སྩལ་པ།
en: The goddess then said:

source: ང་ནི་འཇིག་རྟེན་གསུམ་པོ་ན། །མཐོ་དང་དམའ་བའི་གཟུགས་གྱུར་པ། །བུད་མེད་གཟུགས་དེ་ལ་ནི་འདོད། །ཇི་སྲིད་འཇིག་རྟེན་གྱིས་མི་མཐོང་། །
en: “Whenever a female form is seen In the world of the three abodes, It should be regarded as my form, Be it of low or respectable family.

source: ལྷ་མོ་ལྷ་མིན་མོ་དང་ནི། །
en: “A goddess or demigoddess,

source: དེ་བཞིན་གནོད་སྦྱིན་སྲིན་མོ་དང་། །
en: Or a yakṣiṇī, a rākṣasī,

source: ཀླུ་མོ་འབྱུང་མོ་མི་ཅི་མོ། །དེ་བཞིན་མི་ཡི་བུ་མོ་དང་། །
en: A nāginī, a bhūtinī,

source: དྲི་ཟ་མོ་དང་དམྱལ་བ་མོ། །
en: “A gandharvī, even a female hell-being,

source: དུད་འགྲོའི་བུ་མོ་ཡི་དགས་མོ། །
en: A she-animal, a female hungry ghost,

source: ཚངས་མ་རྒྱལ་རིགས་རྗེ་རིགས་མོ། །
en: A woman from the priestly, warrior, or merchant caste,

source: དམངས་རིགས་མོ་སྟེ་ཤིན་ཏུ་མང་། །
en: Or a peasant woman, or one of endless other groups,

source: ཡིག་མཁན་མ་དང་རྒྱལ་མོ་དང་། །
en: “A scribe, a princess,

source: ཐོད་པ་ཅན་མ་དུང་མཁན་མ། །
en: “A female kāpālika , also a conch worker,

source: གདུགས་མཁན་མ་དང་ཁང་མཁན་མ། །
en: A parasol maker, a house builder,

source: བ་ལང་སོང་དང་མདའ་མཁན་མ། །
en: A cowherd, a fletcher,

source: རིགས་རྣམས་ཀུན་ལ་རབ་ཏུ་འཇུག །
en: A woman of any mixed caste,

source: མ་དང་སྲིང་མོ་ཆུང་མ་དང་། །
en: A mother, a sister, a wife,

source: ཨ་ནེ་དང་ནི་ཚ་མོ་དང་། །
en: A maternal aunt, a niece,

source: ཁ་ཊྚི་ཀ་དང་སྒྱུག་མོ་དང་། །
en: “A paternal aunt, also a mother-in-law,

source: བརྟུལ་ཞུགས་ཅན་དང་རྣལ་འབྱོར་མ། །
en: A lay vow-holder, also a yoginī,

source: ཡུགས་ས་མོ་དང་དཀའ་ཐུབ་མ།
en: Or a widow, or a female ascetic.

source: ཞེས་སོགས་མང་པོ་ཀུན་ལ་ནི། །ང་ནི་བུད་མེད་གཟུགས་གྱུར་ནས། །
en: “These and all other women Possess my form.

source: སེམས་ཅན་ཀུན་གྱི་དོན་ཕྱིར་གནས། །
en: They exist for the welfare of all beings,

source: རང་རང་ཚུལ་དུ་ངེས་པ་ཡིས། །
en: Each identified by her own individual function.

source: རྣལ་འབྱོར་རྣམས་ཀྱིས་བསྟེན་པར་བྱ། །
en: She should be served by the yogin,

source: འོ་དད་འཁྱུད་པ་ལ་སོགས་ཀྱིས། །
en: With kisses, embrace, and the like,

source: རྡོ་རྗེ་པདྨ་མཉམ་སྦྱོར་བ། །
en: And with the union of the vajra and the lotus.

source: སེམས་ཅན་ཀུན་ལ་ཕན་འདོད་པས། །མི་མོ་བསྟེན་པས་དངོས་གྲུབ་པོ། །སྐད་ཅིག་ཙམ་གྱིས་སྟེར་བྱེད་པ། །
en: “Women who are served will, for their part, instantly grant Accomplishment to all those seeking To benefit living beings.

source: དེ་ཕྱིར་བུད་མེད་བསྟེན་པར་བྱ། །
en: One should therefore serve women.

source: བུད་མེད་མཐོ་རིས་བུད་མེད་ཆོས། །
en: “Women are heaven, women are the Dharma,

source: བུད་མེད་དེ་ཉིད་དཀའ་ཐུབ་མཆོག །
en: And women are truly the supreme austerity.

source: སངས་རྒྱས་བུད་མེད་དགེ་འདུན་ཉིད། །བུད་མེད་ཤེས་རབ་ཕར་ཕྱིན་ཉིད། །
en: Women are the Buddha, women are the Saṅgha, Women are the Perfection of Wisdom

source: ཁ་དོག་རྣམ་ལྔའི་རབ་དབྱེ་བས།
en: “They can be divided according to the five colors,

source: སོ་སོར་བརྟག་པར་འདོད་པ་ཡིན། །
en: With their names assigned accordingly—

source: བུད་མེད་གང་ཞིག་ཁ་དོག་སྔོ། །
en: A woman who is of blue color

source: ཞེ་སྡང་རྡོ་རྗེ་མ་རུ་གྲགས། །
en: Has been proclaimed as Hatred Vajrī.

source: བུད་མེད་གང་ཞིག་ཁ་དོག་དཀར། །
en: “A woman who is white

source: གཏི་མུག་རྡོ་རྗེ་མར་འདོད་དོ། །
en: Is known to be Delusion Vajrī;

source: བུད་མེད་གང་ཞིག་ཁ་དོག་སེར། །
en: A woman who is yellow

source: ལྷ་མོ་ཕྲ་མ་རྡོ་རྗེ་མ། །
en: Is the goddess Calumny Vajrī.

source: བུད་མེད་གང་ཞིག་ཁ་དོག་དམར། །
en: “A woman who is pink

source: འདོད་ཆགས་རྡོ་རྗེ་མ་རུ་གྲགས། །
en: Is said to be Passion Vajrī;

source: བུད་མེད་གང་ཞིག་ཁ་དོག་ལྗང་། །
en: A woman who is dark-green

source: ཕྲག་དོག་རྡོ་རྗེ་མ་ཞེས་གྲགས། །
en: Is said to be Envy Vajrī.

source: བཅོམ་ལྡན་ཤེས་རབ་ཕར་ཕྱིན་མ། །གཅིག་ཉིད་ལྔ་ཡི་ཚུལ་གྱིས་གནས། །
en: “There is only one goddess, wisdom, Abiding in five forms.

source: ཡང་དག་སྨྲ་བར་འདུད་བྱས་ནས། །ཐལ་མོ་ཡང་དག་སྦྱར་བྱས་ཏེ། །
en: “Conversation, bowing, Folding one’s hands,

source: བལྟ་དང་རེག་པ་ཉིད་དང་ནི། །དྲན་པ་ཡིས་ནི་སྨྲ་བར་བྱ། །
en: Beholding and touching her, Thinking of her and talking to her,

source: རྟག་ཏུ་འོ་དང་ལག་པས་འཁྱུད། །རྡོ་རྗེ་རྣལ་འབྱོར་མ་མཆོད་བྱ། །
en: “With kissing, embrace, and the like, One should regularly worship Vajrayoginī.

source: ལུས་ཀྱིས་ནུས་པ་རྣམས་བྱས་ནས། །མི་ནུས་པ་རྣམས་ངག་ཡིད་ཀྱིས། །
en: If one is able, one should honor her physically, If not, one should do so verbally or mentally.

source: མཆོད་པས་བརྙེས་དེས་བདག་ལ་ནི། །དངོས་གྲུབ་ཐམས་ཅད་སྩོལ་བར་བྱེད། །
en: “Worshiped by him, pleased, I shall grant complete attainment.

source: དེ་ཡིས་མཐོང་བའི་ལམ་ཞུགས་ནས། །རྣམ་ཀུན་རྟག་ཏུ་ཀུན་ནས་སྟེར། །
en: “Everywhere, always and invariably, I will be within his sight.

source: རང་གི་བུད་མེད་འདོད་བསྟེན་བྱ། །
en: One should make love to one’s woman

source: མ་ལུས་གཟུགས་ཀྱིས་བདག་བསྒོམས་ནས། །
en: Visualizing her in my complete form.

source: རྡོ་རྗེ་པདྨོ་མཉམ་སྦྱོར་བས། །
en: “By the union of vajra and lotus,

source: དེ་ཕྱིར་རྣམ་པ་ཀུན་གྱི་ནི། །བདག་ལ་གུས་པས་མཆོག་ཏུ་དེ། །
en: Therefore, if someone wholly dedicated To propitiating me in all forms

source: དམྱལ་བ་ལ་སོགས་ངན་འགྲོ་ཡི། །སྡིག་པ་ཡིས་ཀྱང་འཇིགས་མི་བྱ། །
en: “He should neither be afraid of nonvirtue, Nor of difficult rebirths—in hell and so on.

source: ཇི་སྲིད་ནུས་པ་ཐོབ་མི་འགྱུར། །སྡིག་པ་ཅུང་ཟད་ཡོད་མིན་ཞིང་། །བསོད་ནམས་ཅུང་ཟད་ཡོད་མིན་ཕྱིར།
en: For as long as he does not obtain power. “There is no evil whatsoever, Nor is there any merit—

source: སེམས་ཉིད་མི་སྲུང་འཇིག་རྟེན་གང་། །སྡིག་དང་བསོད་ནམས་རྣམ་པར་གནས། །
en: The conventional distinction between virtue and nonvirtue Is for ordinary people, to be guarded in their minds.

source: གང་དུ་སེམས་ཉིད་ཙམ་གྱིས་ནི། །ཐམས་ཅད་སྐད་ཅིག་ཙམ་དེ་གནས། །
en: “Since everything is only mind, And its duration is only momentary,

source: དམྱལ་བར་འགྲོ་བ་འདིར་གང་གིས། །
en: Who is it that goes to hell,

source: གང་གིས་འདིར་ནི་མཐོ་རིས་འགྲོ། །
en: And who is it that goes to heaven?

source: གང་གིས་དུག་བཏགས་མཐུ་ཡིས་འཆི། །ཇི་ལྟ་བ་ལ་དེ་ཉིད་མེད། །དུག་གི་མཐུ་ཡིས་ཡང་དག་བརྒྱལ། །
en: “Just as one meets one’s death in distress, Thinking that it is caused by poison Even when there is no poison,

source: དེ་བཞིན་མཐོ་རིས་ངན་འགྲོར་འགྲོ།
en: So too one goes to heaven or the lower realms.

source: དེ་ཉིད་ཡོངས་སུ་ཤེས་གྱུར་པའི། །མཁས་པས་མྱ་ངན་འདས་པ་འཐོབ། །
en: “Nirvāṇa is attained by the wise ones As the result of a complete understanding of the way things are.

source: མྱང་འདས་སྟོང་པའི་ཚུལ་ཉིད་དུ། །མར་མེ་རླུང་གིས་ཇི་བཞིན་དུ། །
en: Nirvāṇa has the nature of emptiness, Like that of a candle blown out by the wind.

source: དེ་ཕྱིར་ཐམས་ཅད་ཡོངས་སྤངས་ནས།
en: Therefore, having renounced everything,

source: བདག་ཉིད་གུས་བྱ་བརྟུལ་ཞུགས་ཅན། །
en: A vow-holder should only propitiate me.

source: སྐད་ཅིག་ཙམ་གྱིས་གཏུམ་པོ་ཡི། །དངོས་གྲུབ་སྟེར་བར་ཐེ་ཚོམ་མེད། །
en: “I grant, instantaneously, the accomplishment of Caṇḍa­mahā­roṣaṇa, there is no doubt.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་མ་ལ་གསོལ་པ།
en: Then the lord said to the goddess, Perfection of Wisdom

source: ཇི་ལྟ་བུ་ཡི་རྣམ་པ་ཡིས། །གཏུམ་མོའི་དངོས་གྲུབ་ཅི་འདྲ་ཞིག །
en: “Of what form is Caṇḍa­mahā­roṣaṇa, And of what kind is his accomplishment?”

source: ཁ་དོག་ལྔ་ཡི་རབ་དབྱེ་བས། །རྣལ་འབྱོར་མ་རུ་རབ་གྲགས་གང་། །
en: “The yoginīs are said to be of five types, Corresponding to the five colors.

source: དེ་ཡང་རང་རང་བདག་པོ་ཡི། །
en: And they have their respective husbands,

source: ཁ་དོག་ལྔ་ཡི་རབ་དབྱེ་ལས། །གཏུམ་པོ་ཀུན་གྱི་དེ་ཉིད་འདིས། །
en: According to the division of five colors. “And in truth, each of them is Caṇḍa­mahā­roṣaṇa—

source: ཁ་དོག་སྔོན་པོ་གང་དེ་ཡང་། །བདག་པོ་མི་གཡོ་སྔོན་པོར་ཤེས། །
en: The husband who is of blue color Is known as Blue Acala.

source: ཁ་དོག་དཀར་པོའི་བདག་པོ་གང་། །མི་གཡོ་དཀར་པོ་ཞེས་བྱའོ། །
en: “The husband who is of white color— He is called White Acala.

source: ཁ་དོག་སེར་པོའི་བདག་པོ་གང་། །མི་གཡོ་སེར་པོ་ཡང་དག་གྲགས། །
en: The husband who is of yellow color— He is said to be Yellow Acala.

source: ཁ་དོག་དམར་པོའི་བདག་པོ་གང་། །མི་གཡོ་དམར་པོ་ཞེས་གྲགས་སོ། །
en: “The husband who is of pink color— He is said to be Red Acala.

source: ཁ་དོག་ལྗང་གུའི་བདག་པོ་གང་། །མི་གཡོ་ལྗང་གུ་ཞེས་བྱའོ། །
en: The husband who is of dark-green color— He is said to be Green Acala.

source: གཏུམ་པོ་དེ་ཉིད་གཅིག་པུ་ཉིད། །རྣམ་པ་ལྔ་ཡི་ཚུལ་གྱིས་གནས།
en: “There is only one Caṇḍa­mahā­roṣaṇa, Abiding in five forms.

source: འདི་ཡི་དངོས་གྲུབ་བརྟན་པ་ཉིད། །དེ་ནི་གཏུམ་པོར་ཡང་དག་བཤད། །
en: He is called Caṇḍa­mahā­roṣaṇa, As his accomplishment is unflagging.

source: ནམ་མཁའི་མཐར་ཐུག་ཇི་སྙེད་པ། །
en: “Until the farthermost reaches of space,

source: གཏུམ་པོའི་དངོས་གྲུབ་ཇི་བཞིན་གསུངས། །དེ་བཞིན་དུ་ནི་གཏུམ་མོ་འགྲུབ།
en: Just as the accomplishment of Caṇḍa­mahā­roṣaṇa is described here, So too can the accomplishment of Caṇḍī be gained.”

source: དཔའ་བོ་གཅིག་པ་ཉིད་དུ་གསུངས་པའི་དཔལ་ཁྲོ་བོ་གཏུམ་པོའི་རྒྱུད་ལས། ངོ་བོ་ཉིད་ཀྱི་རིམ་པར་ཕྱེ་བ་སྟེ་བརྒྱད་པའོ།། །།
en: Thus concludes the chapter on Caṇḍa­mahā­roṣaṇa’s nature, the eighth in the glorious Caṇḍa­mahā­roṣaṇa tantra called “ The Sole Hero

source: མི་མོ་མངོན་བྱས་རྣལ་འབྱོར་པས། །
en: “A yogin should place the woman in front

source: ལུས་ནི་དྲང་པོར་མཉམ་གནས་ནས། །རྩེ་གཅིག་ཡིད་ཀྱིས་བསམ་གཏན་བྱ། །
en: He should make his body straight And meditate with one-pointed mind.

source: སྐུ་བཞི་ཡི་ནི་རང་བཞིན་ཕྱིར། །
en: “Because of the nature of the four bodies,

source: ཐབས་དང་ཤེས་རབ་ཉིད་དུ་འདོད། །འཆི་བ་ཉིད་ནི་ཆོས་སུ་བརྗོད། །
en: A distinction is perceived between wisdom and means . “Death is said to be the dharmakāya;

source: ལོངས་སྤྱོད་རྫོགས་པ་བར་སྲིད་དང་། །
en: saṃbhogakāya is the intermediate state after death;

source: འགྲོ་བ་དྲུག་གཟུགས་སྤྲུལ་པ་དང་། །
en: Nirmāṇakāya has the form of the six modes of existence;

source: འདོད་པའི་ལོངས་སྤྱོད་བདེ་ཆེན་པོ། །
en: The pleasure of sex is Great Bliss.

source: སྐུ་བཞི་ཡི་ནི་རང་བཞིན་འདི། །སྐྱེས་བུ་ལ་ནི་ཁམས་གསུམ་པ། །
en: “This male form, in the three realms, Has the nature of the four bodies;

source: སྐུ་བཞི་ཡི་ནི་རང་བཞིན་ཕྱིར། །བུད་མེད་གཟུགས་ལ་ཁམས་གསུམ་མོ། །
en: The female form, in the three realms, Also has the nature of the four bodies.

source: སྐུ་བཞི་ཡི་ནི་རང་བཞིན་ལས། །སྐྱེས་བུ་འདིར་ནི་སངས་རྒྱས་ཡིན། །
en: “The man is the Buddha, Because he has the nature of the four bodies.

source: བུད་མེད་ཤེས་རབ་ཕར་ཕྱིན་མར། །ཕྱོགས་རྣམས་ཀུན་དུ་རྣམ་པར་གནས། །
en: The woman, present in all directions, Is the Perfection of Wisdom

source: དེ་ཉིད་ང་རྒྱལ་བྱས་པ་ཡིས། །
en: “The man should do the deity-identification in the following way:

source: སླར་ཡང་བདག་ལ་དངོས་གྲུབ་བོ། །ཁྲོ་བོ་གཏུམ་པོའི་ཚུལ་ཉིད་དུ། །རང་ཉིད་གཟུགས་ཀྱིས་ཡང་དག་གནས། །
en: ‘I am an accomplished one, Abiding in my own nature— The nature of Caṇḍa­mahā­roṣaṇa.

source: འདི་ནི་གུས་པ་དང་བཅས་བསྒོམ། །
en: In this way should one meditate with reverence,

source: ལས་ཀུན་ཡོངས་སུ་སྤང་བྱས་ནས། །
en: “Having abandoned all activity,

source: བདེ་བའི་སེམས་ཉིད་གཅིག་པུས་གནས། །
en: One should remain with one’s mind focused solely on pleasure,

source: ཇི་སྲིད་དངོས་གྲུབ་མ་ཐོབ་པར། །
en: Until one attains accomplishment.

source: གང་ཚེ་རྣལ་འབྱོར་དངོས་གྲུབ་ཐོབ། །
en: “When the yogin has attained accomplishment,

source: རླུང་དང་སེམས་ཀྱི་འཛུམ་མདངས་ནི། །འཇིག་རྟེན་པ་ཡིས་མཐོང་བ་མེད། །
en: He is invisible to people When merged with the prāṇa-mind.

source: ཀུན་མཁྱེན་ཀུན་ལ་ཁྱབ་པའོ། །
en: “Omniscient, omnipresent, all-pervading,

source: ཉོན་མོངས་ཀུན་ལས་རྣམ་པར་འདས། །
en: Free from all afflictions,

source: དེ་ལ་ནད་དང་རྒས་པ་མེད། །
en: For him there is no disease, nor old age;

source: དེ་ལ་འཆི་བ་ཡོད་མིན་ཏེ། །
en: Death does not exist for him.

source: དེ་ལ་དུག་གིས་འདའ་བ་མེད། །
en: “Poison has no effect on him,

source: མཚོན་གྱིས་མ་ཡིན་དགྲ་ཡི་ནི། །དབང་དུ་ནམ་ཡང་འགྲོ་བ་མིན། །
en: Neither weapons nor enemy hordes Can ever prevail over him.

source: དགོས་འདོད་མ་ལུས་འབྱུང་བར་འགྱུར། །
en: “Yet all the objects of desire arise for him

source: ཡིད་ཀྱིས་བསམས་པ་ཙམ་གྱིས་ནི། །
en: Merely through a mental wish.

source: སྐད་ཅིག་དེ་ལ་འབད་མེད་པར། །ཡིད་བཞིན་ནོར་བུ་དང་མཚུངས་འགྱུར།
en: At that moment, one becomes, effortlessly, The same as a wish-fulfilling gem.

source: མ་ལུས་འཇིག་རྟེན་ཁམས་རྣམས་སུ། །
en: “In all the realms of the world,

source: གང་དང་གང་དུ་དེ་བཞིན་གཤེགས། །དེ་ནི་གཞལ་ཡས་མཁའ་འགྲོ་སྟེ། །
en: Wherever one may happen to be, There palaces will arise for him

source: དེར་ནི་འདོད་ཀུན་དེ་རྣམས་ཀྱིས། །
en: With all desired things.

source: གཟུགས་དང་ལང་ཚོས་རབ་བརྒྱན་པའི། །ལྷ་ཡི་བུ་མོ་དགའ་མས་དེར། །
en: “Delightful, heavenly women, Adorned with beauty and youth,

source: ཇི་སྙེད་མཐོ་རིས་སྐར་མ་རྣམས། །
en: As numerous as stars in the sky,

source: ཐེ་ཚོམ་མེད་པ་ཉིད་དུ་འགྱུར། །
en: Will without doubt be his.

source: ཚངས་དང་ཁྱབ་འཇུག་དབང་ཕྱུག་གང་། །བརྒྱ་བྱིན་ཡན་ལག་མེད་སོགས་གང་། །
en: “The gods, such as Brahmā, Viṣṇu, and Śiva,

source: མངག་གཞུག་འགྱུར་ཞིང་འགྲོ་དྲུག་ཏུ། །གནས་པའི་སྲོག་ཆགས་ཀུན་ཀྱང་ངོ་། །
en: Will be his servants; And so will all the beings living in the six realms.

source: རྣལ་འབྱོར་དངོས་གྲུབ་ཇི་ལྟ་བཞིན། །དེ་བཞིན་རྣལ་འབྱོར་མས་ཀྱང་ངོ་། །
en: “Just as the yogins attain accomplishment, In exactly the same way do the yoginīs.

source: སྐྱེས་བུ་རྡོ་རྗེ་འཛིན་པ་ལྟར། །བུད་མེད་རྡོ་རྗེ་བཙུན་མོའོ། །
en: The men have the form of Vajradhara, The women that of the ‌vajra-woman.”

source: བཅོམ་ལྡན་འདས་ལུས་འདི་ལ་ཐབས་དང་ཤེས་རབ་ཀྱི་སྦྱོར་བ་ལས་བདེ་བ་ཆེན་པོ་ཇི་ལྟར་སྐྱེ་བ་ལགས།
en: “In what way, O lord, does Great Bliss arise in the body through the union of wisdom and means

source: བརྐྱང་མ་ཤེས་རབ་རང་བཞིན་ཏེ། །
en: “The lalanā channel, with the nature of wisdom,

source: རོ་མ་ཐབས་ཀྱི་རང་བཞིན་གྱིས། །
en: And the rasanā, with the nature of means

source: གཡས་པ་ལ་ནི་ཡང་དག་གནས། །
en: Is located on the right.

source: བརྐྱང་མ་རོ་མའི་དབུས་དག་ལ། །
en: “In the center between the lalanā and the rasanā

source: གང་ཚེ་ཨ་བ་དྷུ་ཏཱིར་རླུང་། །ཁུ་བ་དང་ནི་རོ་གཅིག་གྱུར། །
en: When the wind in the avadhūtī has become Of the same essence with semen,

source: རྡོ་རྗེས་མགོ་བོའི་མཚམས་སུ་འགྲོ། །བུད་མེད་བྷ་གའི་རནྟ་ལ། །
en: Passing through the opening of the penis, inside the bhaga of the woman.

source: ཐབས་དང་ཤེས་རབ་མཉམ་སྦྱོར་བས། །
en: By the union of the wisdom and the means

source: ལྟེ་བར་གནས་པའི་ཙཎྜ་ལི། །
en: Caṇḍālī, who is located at the navel,

source: མར་མེ་ལྟར་འབར་དེ་ཡིས་ནི། །ཞུ་བའི་ཁུ་བ་མཆོག་ལ་ནི། །
en: “Burns like a lamp—through this The best semen is caused to flow.

source: དེ་ལས་སྐྱེས་པའི་བདེ་བ་ལ། །ཅུང་ཟད་ཅུང་ཟད་རབ་སྦྱོར་ལས། །
en: Through this arises a lesser bliss, If the effort applied is small.

source: དེ་ཡང་ཆེན་པོ་ཆེར་སྦྱོར་ལས། །དེ་ཡང་དངོས་པོའི་རང་བཞིན་ལས། །
en: “With big effort, the bliss is intense— For this is the nature of things.

source: གང་གིས་དེ་ཡི་བདེ་བ་འཕེལ། །རྟག་ཏུ་གོམས་པའི་སྦྱོར་བ་ལས། །
en: Whoever can engender this bliss Through regular practice,

source: དེ་ནི་སྐྱེ་བ་འདི་ཉིད་ལ། །དཔལ་ལྡན་གཏུམ་པོ་ཉིད་དུ་འགྱུར།
en: “Will become glorious Caṇḍa­mahā­roṣaṇa In this very life.”

source: དཔའ་བོ་གཅིག་པ་ཉིད་དུ་གསུངས་པའི་དཔལ་ཁྲོ་བོ་གཏུམ་པོའི་རྒྱུད་ལས། བསམ་གཏན་གྱི་རིམ་པར་ཕྱེ་པ་སྟེ་དགུ་པའོ།།
en: This concludes the chapter on meditation, the ninth in the glorious Caṇḍa­mahā­roṣaṇa tantra called “ The Sole Hero

source: ཅི་སྟེ་བཅོམ་ལྡན་སྒྲུབ་པ་པོས། །ཁྲོ་ཆེན་གཏུམ་པོའི་གོ་འཕང་ནི། །བུད་མེད་དང་བྲལ་བསྒྲུབ་ནུས་སམ། །
en: “Is it possible, O lord, to attain the level of Caṇḍa­mahā­roṣaṇa even without a woman?

source: འོན་ཏེ་བསྒྲུབ་པར་ནུས་མ་ཡིན། །
en: Or is it not possible?”

source: ལྷ་མོ་བསྒྲུབ་པར་ནུས་པ་མ་ཡིན་ནོ།
en: “It is not possible, O goddess.”

source: བཅོམ་ལྡན་འདས་མས་གསོལ་པ།
en: the goddess said,

source: བཅོམ་ལྡན་འདས་ཅིའི་ཕྱིར་ན་བདེ་བ་སྟེར་བ་མེད་པར་མི་ནུས།
en: “Is it impossible, O lord, because bliss does not arise?”

source: བདེ་བ་ཁྱད་འཕགས་འབྱུང་བ་ལས། །དེ་ཉིད་འཐོབ་ཀྱིས་དེ་གཞིན་མིན། །
en: Only by the arising of a particular kind of bliss Can it be reached, not otherwise.

source: བྱེད་པོ་བུད་མེད་དང་སྦྱོར་ལས། །གཞན་དུ་ནམ་ཡང་མ་ཡིན་ནོ། །
en: It is produced only through the right cause. And the cause is union with a woman; There is no other cause, ever.

source: སྒྱུ་མའི་དེ་ཉིད་ཐམས་ཅད་ལ། །
en: “Among all illusions,

source: བུད་མེད་སྒྱུ་མའི་དེ་ཉིད་བསྔགས། །
en: Only the illusion of a woman is praised.

source: དེ་ཡི་དེ་ཉིད་ལས་འདས་གང་། །དེ་ལས་དངོས་གྲུབ་ལྷག་འབྱུང་མེད། །
en: Whoever would transgress against her Will not attain accomplishment.

source: དེ་ཕྱིར་བུད་མེད་དང་བྲལ་འདི། །
en: “Therefore separation from women

source: ནམ་ཡང་བྱ་བ་མ་ཡིན་ནོ། །
en: Must never take place.

source: དེ་ཉིད་གལ་ཏེ་སྡུག་བསྔལ་གྱུར། །
en: So if there should occur suffering,

source: འཆི་དང་འཆིང་བའི་འཇིགས་པ་ཡང་། །
en: Death, bondage, or fear—

source: དེ་རྣམས་ཐམས་ཅད་བཟོད་བྱ་ཡིས། །འདིར་ནི་བུད་མེད་སྤང་མི་བྱ། །
en: “One should put up with all of this, Rather than abandon a woman,

source: གཡོ་དང་སྤོབས་ཅན་མཚེར་ངོ་བྲལ། །
en: “Without modesty, fickle, impudent,

source: རྟག་ཏུ་འདོད་པའི་དཔུང་གཉེན་ནོ། །
en: Wholly in pursuit of desires—

source: དངོས་གྲུབ་སྟེར་བ་འདི་ཉིད་ནི། །
en: Yet they alone grant accomplishment;

source: བུད་མེད་ཚུལ་ནི་གཅིག་བརྗོད་པ། །
en: “What can be said of the nature of woman—

source: དེ་ཕྱིར་ཀུན་གྱིས་བུད་མེད་ལྷར། །རྣམ་པ་ཀུན་དུ་རབ་ཏུ་བརྟག །
en: “Therefore all women should be viewed As goddesses on all occasions.

source: ཤིང་དང་རྡོ་ལ་སོགས་རྣམས་ཀྱང་། །
en: Even wood, stone, and other objects

source: ཡིད་ཀྱིས་ཡོངས་སུ་བརྟག་པར་བྱ། །
en: Should be imagined, in one’s mind, as such.

source: སྐྱེས་བ་བུད་མེད་ལྷ་མོ་དང་། །བུད་མེད་ཀྱི་ནི་སྐྱེས་པ་ལྷ། །
en: “For a woman, the man is a deity; For a man, the woman is a deity.

source: རྡོ་རྗེ་པདྨ་རབ་སྦྱོར་བས། །ཕན་ཚུན་དུ་ནི་མཆོད་པར་བྱ། །
en: They should honor each other By uniting the vajra and the lotus.

source: དེ་ཕྱིར་རྣལ་འབྱོར་བརྩེ་ལྡན་པས། །དཀྱིལ་འཁོར་མདུན་དུ་བྱས་ནས་ནི། །
en: Therefore the yogin, filled with compassion, Should set up the maṇḍala in front;

source: དེ་ལ་ཉེར་ཞུགས་བུད་མེད་ནི། །ཤེས་རབ་ཕར་ཕྱིན་རྣམ་པ་ལ།
en: “Then he should lead the woman there In her form, which is none other than Perfection of Wisdom

source: མེ་ཏོག་གིས་མཆོད་ཅིང་། །དེ་བཞིན་སྤོས་དང་མར་མེ་སོགས། །
en: One must worship her with flowers, Lamps, incense, and so forth.

source: དེ་ནས་གཡས་སུ་བསྐོར་བ་བྱ། །
en: Then one should circumambulate her clockwise—

source: གུས་པ་དང་བཅས་སེམས་ཀྱིས་ནི། །དེ་བཞིན་སྐྱེས་བུས་བུད་མེད་མཆོད། །
en: “In the same way, a woman should worship a man— With respect, and with the mind filled with devotion.

source: དེ་ཉིད་མཆོད་པའི་ཆོ་ག་ནི། །རྒྱལ་བས་ཕན་ཚུན་བྱ་བར་གསུངས། །
en: She should perform the worship, in reciprocity, As has been taught by the victorious ones.

source: བུད་མེད་སྨད་པར་ཡོང་མི་བྱ། །
en: “One must not scold a woman,

source: དེ་ཉིད་འདོད་པའང་སྤང་མི་བྱ། །
en: Nor can one abandon her when being asked for a favor.

source: སྙན་པའི་ཚིག་གིས་སྨྲ་བྱ་ཞིང་། །
en: One should speak nice words

source: རྗེས་སུ་མཐུན་པར་སྦྱིན་པར་བྱ། །
en: And give her things according to need.

source: ཇི་བཞིན་གདུག་ཅན་ཤེས་མི་བྱ། །
en: So that she does not perceive one as a villain.

source: གང་དུའང་བུད་མེད་མི་སྤོང་བ། །འདི་ནི་སངས་རྒྱས་གསུང་དུ་ཐོས། །
en: One must never abandon a woman wherever one may be, After hearing this teaching of the Buddha.

source: གང་དུ་ཁྱོད་ཀྱིས་གཞན་བྱས་ནས། །
en: “Whoever should act otherwise,

source: དེ་ཡི་སྡིག་པས་དམྱལ་བར་འགྱུར།
en: That evildoer will end up in hell.
